#Задание 1.3
m=float(input("Введите вещественное число: "))
for i in range(1, 11):
    print(f'{i}*{m} = {i*m}')